{
    "page_one": "<div className=\"m-5\"> <p> In early 2024, Apple mandated all apps to include a Privacy Manifest file, named <strong> PrivacyInfo.xcprivacy </strong>. Apps not complying risk rejection from May 1, 2024. This XML file describes data collection practices, especially for 'tracking', which involves sharing data for targeted ads. It requires: </p> <br/> 1. A yes/no declaration on tracking usage and related domains. <br/> 2.  A list of collected data types, stating purposes and tracking status. <br/> 3. Declaration of 'Required reason' APIs usage and purposes, crucial for cross-app device linking. <br/><br/> <p>The 'types of data being collected' section mirrors App Store Connect's 'App Privacy > Data Types'. 'Required reason' APIs are highlighted due to their potential for cross-app device linking, particularly concerning common SDKs used for advertising. For detailed information, refer to Apple's official documentation. </p> </div>",
    "page_two": "<div className=\"m-5\">  <p> <strong>Do I need a Privacy Manifest for my app?</strong> </br> </br> Oh yes, this is mandatory. In early 2024, Apple mandated all apps to include a Privacy Manifest file, PrivacyInfo.xcprivacy. Warning emails began on April 1, 2024, and non-compliant apps face rejection from May 1, 2024. </br> </br> <strong>How do I get a Privacy Manifest file?</strong> </br> </br> XCode offers a .plist editing interface to assist in generating XML for PrivacyInfo.xcprivacy. However, it's cumbersome and not suitable for apps built on different frameworks.</br> </br> <strong>How do I use this site?</strong> </br> </br> Fill out the fields below to download your PrivacyInfo.xcprivacy file. Save it in your iOS app's root directory, and you're set. However, understanding which API types to choose for the 'Required reason' APIs can be complex, especially as some are low-level methods commonly called by third-party SDKs. When you upload your binary to Apple, they conduct static analysis and email you regarding the API types used, clarifying which ones to include. </p> </div>",
    "socials": [
    {
      "link": "https://github.com/rushikeshpandit",
      "icon": "../github.svg",
      "label": "github"
    },
    {
      "link": "https://www.linkedin.com/in/rushikesh-pandit-646834100/",
      "icon": "../linkedin.svg",
      "label": "linkedin"
    },
    
    {
      "link": "mailto:rushikesh.d.pandit@gmail.com",
      "icon": "../email.svg",
      "label": "email"
    }
]
}