{
    "page_one": "What's a Privacy Manifest? In early 2024, Apple announced that all apps would soon need to include a Privacy Manifest file, named PrivacyInfo.xcprivacy, with warning emails starting to be sent since 1 April 2024 and apps without the PrivacyInfo.xcprivacy expected to be rejected from 1 May 2024. The PrivacyInfo.xcprivacy is an XML file, following Apple's .plist format, that describes all the ways that your app might collect data about you, or your device, and if that data is used for 'tracking'. In this context, 'tracking' means giving the data to some other company that will use that data to show you targeted ads (like, um, Google and Meta?). There's 3 main types of data to be supplied in the Privacy Manifest: A yes/no question about whether your app uses data for 'tracking' and, if so, what domains is the data being sent to. A list of all the types of data being collected, noting why that data is being collected and if it's being used for tracking. A list stating which (if any) of these 6 categories of iOS framework methods you're using, referred to as 'Required reason' APIs, noting why you're using them. The structure of the data in the 'types of data being collected' section closely matches 'App Privacy > Data Types' section in App Store Connect. The 'Required reason' APIs (a grammatical abomination) is there because the methods it covers can be used to link the one device across different apps. This is of particular interest to suppliers of common (advertising related) SDKs that get widely integrated. There's quite a bit more to this, especially in regards to the 3rd party SDKs. Click here to read Apple's official documentation.",
    "page_two": "Do I need a Privacy Manifest for my app? Oh yes, this is mandatory. In early 2024, Apple announced that all apps would soon need to include a Privacy Manifest file, named PrivacyInfo.xcprivacy, with warning emails starting to be sent since 1 April 2024 and apps without the PrivacyInfo.xcprivacy expected to be rejected from 1 May 2024. How do I get a Privacy Manifest file? XCode has a .plist editing interface that kind of helps to generate the necessary XML in the PrivacyInfo.xcprivacy file, but it's clunky and is obviously not that helpful for apps being built on other frameworks. Fear not, the We Make Apps Apple Privacy Manifest Maker (a.k.a. the Manifestomatic 3000™) is here to help! How do I use this site? You simply fill out the fields below and download your PrivacyInfo.xcprivacy file, save it in the root of you iOS app and you're good to go. This form assumes that you already have a good understanding of what all the fields on this form mean. Understanding what API types to choose for the 'Required reason' APIs can be complicated, as some of these are fairly low-level methods which are often being called by 3rd party SDKs. You'll quickly find out which ones you need to include when you upload your binary to Apple, as they do static analysis on the bundle and send you an email for all the API types that are being used. I love this! Thanks! We made this form to streamline our own processes (we manage loads of apps) and happy to share for free. Show your love by sharing this page widely."
}